Acquiring state lock. This may take a few moments...
module.lambda_layer.data.archive_file.pymysql_layer: Reading...
module.lambda_layer.data.archive_file.pymysql_layer: Read complete after 0s [id=fdbcd5e1107f297ea43bc9c2c8cf137dabe8d5aa]
module.monitoring.module.grafana.data.aws_caller_identity.current: Reading...
module.monitoring.module.grafana.data.aws_partition.current: Reading...
module.monitoring.module.grafana.data.aws_partition.current: Read complete after 0s [id=aws]
module.monitoring.module.grafana.data.aws_iam_policy_document.assume[0]: Reading...
module.monitoring.module.grafana.data.aws_iam_policy_document.assume[0]: Read complete after 0s [id=1565249789]
module.monitoring.module.grafana.data.aws_caller_identity.current: Read complete after 1s [id=635140758252]
module.monitoring.module.grafana.data.aws_iam_policy_document.this[0]: Reading...
module.monitoring.module.grafana.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=4267208854]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # helm_release.grafana will be created
  + resource "helm_release" "grafana" {
      + atomic                     = false
      + chart                      = "grafana"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "grafana"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "7.3.7"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "adminPassword"
          + value = "grafana12!@"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "service.type"
          + value = "ClusterIP"
            # (1 unchanged attribute hidden)
        }
    }

  # helm_release.kube_prometheus_stack will be created
  + resource "helm_release" "kube_prometheus_stack" {
      + atomic                     = false
      + chart                      = "kube-prometheus-stack"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "kube-prometheus-stack"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "58.0.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.docker_images.aws_lambda_function.news-crawler_mw will be created
  + resource "aws_lambda_function" "news-crawler_mw" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "news-crawler-lambda"
      + id                             = (known after apply)
      + image_uri                      = (sensitive value)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 180
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = (known after apply)
          + subnet_ids                  = (known after apply)
          + vpc_id                      = (known after apply)
        }
    }

  # module.eks.aws_ecr_lifecycle_policy.spring_app will be created
  + resource "aws_ecr_lifecycle_policy" "spring_app" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Delete untagged images older than 1 days"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 1
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "spring-app"
    }

  # module.eks.aws_eks_cluster.this will be created
  + resource "aws_eks_cluster" "this" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = true
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "news-cluster"
      + platform_version              = (known after apply)
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "Name" = "news-cluster"
        }
      + tags_all                      = {
          + "Name" = "news-cluster"
        }
      + version                       = (known after apply)

      + access_config (known after apply)

      + kubernetes_network_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_eks_node_group.default will be created
  + resource "aws_eks_node_group" "default" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "news-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.medium",
        ]
      + node_group_name        = "news-cluster-ng"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "Name" = "news-cluster-ng"
        }
      + tags_all               = {
          + "Name" = "news-cluster-ng"
        }
      + version                = (known after apply)

      + node_repair_config (known after apply)

      + remote_access {
          + ec2_ssh_key = "my-kp"
        }

      + scaling_config {
          + desired_size = 2
          + max_size     = 3
          + min_size     = 1
        }

      + update_config (known after apply)
    }

  # module.eventbridge_scheduler.aws_cloudwatch_event_rule.lambda_schedule["crawler"] will be created
  + resource "aws_cloudwatch_event_rule" "lambda_schedule" {
      + arn                 = (known after apply)
      + description         = "Lambda Schedule for news-crawler-lambda"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "crawler"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(50 0-23 ? * MON-FRI *)"
      + tags_all            = (known after apply)
    }

  # module.eventbridge_scheduler.aws_cloudwatch_event_rule.lambda_schedule["sending_news"] will be created
  + resource "aws_cloudwatch_event_rule" "lambda_schedule" {
      + arn                 = (known after apply)
      + description         = "Lambda Schedule for news-lambda-handler"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "sending-news"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 * ? * MON-FRI *)"
      + tags_all            = (known after apply)
    }

  # module.eventbridge_scheduler.aws_cloudwatch_event_target.lambda_target["crawler"] will be created
  + resource "aws_cloudwatch_event_target" "lambda_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "crawler"
      + target_id      = "crawler"
    }

  # module.eventbridge_scheduler.aws_cloudwatch_event_target.lambda_target["sending_news"] will be created
  + resource "aws_cloudwatch_event_target" "lambda_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "sending-news"
      + target_id      = "sending-news"
    }

  # module.eventbridge_scheduler.aws_lambda_permission.allow_eventbridge["crawler"] will be created
  + resource "aws_lambda_permission" "allow_eventbridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "news-crawler-lambda"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge-crawler"
      + statement_id_prefix = (known after apply)
    }

  # module.eventbridge_scheduler.aws_lambda_permission.allow_eventbridge["sending_news"] will be created
  + resource "aws_lambda_permission" "allow_eventbridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "news-lambda-handler"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge-sending-news"
      + statement_id_prefix = (known after apply)
    }

  # module.iam.aws_iam_policy.lambda_policy will be created
  + resource "aws_iam_policy" "lambda_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "lambda_sql_initializer_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "rds:DescribeDBInstances",
                          + "rds-data:ExecuteStatement",
                          + "rds-db:connect",
                          + "lambda:PublishLayerVersion",
                          + "lambda:Get*",
                          + "lambda:List*",
                          + "ses:SendEmail",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.iam.aws_iam_policy.lambda_vpc_access_policy will be created
  + resource "aws_iam_policy" "lambda_vpc_access_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "lambda_vpc_access_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:CreateNetworkInterface",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DeleteNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.iam.aws_iam_policy.terraform_monitoring_policy will be created
  + resource "aws_iam_policy" "terraform_monitoring_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "terraform-monitoring-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "cloudwatch:*",
                          + "logs:*",
                          + "grafana:*",
                          + "ec2:DescribeInstances",
                          + "rds:DescribeDBInstances",
                          + "lambda:ListFunctions",
                          + "iam:PassRole",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.iam.aws_iam_role.eks_cluster_role will be created
  + resource "aws_iam_role" "eks_cluster_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "EKSClusterRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam.aws_iam_role.eks_node_role will be created
  + resource "aws_iam_role" "eks_node_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "EKSNodeInstanceRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam.aws_iam_role.lambda_exec_role will be created
  + resource "aws_iam_role" "lambda_exec_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda_sql_initializer_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam.aws_iam_role.terraform_monitoring_role will be created
  + resource "aws_iam_role" "terraform_monitoring_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "terraform-monitoring-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam.aws_iam_role_policy_attachment.attach_monitoring_policy will be created
  + resource "aws_iam_role_policy_attachment" "attach_monitoring_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "terraform-monitoring-role"
    }

  # module.iam.aws_iam_role_policy_attachment.ec2_container_registry_read_only will be created
  + resource "aws_iam_role_policy_attachment" "ec2_container_registry_read_only" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "EKSNodeInstanceRole"
    }

  # module.iam.aws_iam_role_policy_attachment.eks_cluster_attach will be created
  + resource "aws_iam_role_policy_attachment" "eks_cluster_attach" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "EKSClusterRole"
    }

  # module.iam.aws_iam_role_policy_attachment.eks_cni will be created
  + resource "aws_iam_role_policy_attachment" "eks_cni" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "EKSNodeInstanceRole"
    }

  # module.iam.aws_iam_role_policy_attachment.eks_worker_node will be created
  + resource "aws_iam_role_policy_attachment" "eks_worker_node" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "EKSNodeInstanceRole"
    }

  # module.iam.aws_iam_role_policy_attachment.lambda_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "lambda_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "lambda_sql_initializer_role"
    }

  # module.iam.aws_iam_role_policy_attachment.lambda_vpc_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "lambda_vpc_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "lambda_sql_initializer_role"
    }

  # module.igw.aws_internet_gateway.this will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "team-igw"
        }
      + tags_all = {
          + "Name" = "team-igw"
        }
      + vpc_id   = (known after apply)
    }

  # module.lambda_layer.aws_lambda_layer_version.pymysql will be created
  + resource "aws_lambda_layer_version" "pymysql" {
      + arn                         = (known after apply)
      + code_sha256                 = (known after apply)
      + compatible_runtimes         = [
          + "python3.11",
        ]
      + created_date                = (known after apply)
      + filename                    = "../../modules/lambda/layer/pymysql_layer.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "pymysql-layer"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = "UsCtUjNZjqOdCFfzT/mVwAal45B1Mls0Ah7pwZx3abA="
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # module.monitoring.aws_cloudwatch_metric_alarm.lambda_crawler_error will be created
  + resource "aws_cloudwatch_metric_alarm" "lambda_crawler_error" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Lambda Crawler Error"
      + alarm_name                            = "lambda-crawler-errors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "news-crawler-lambda"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # module.monitoring.aws_cloudwatch_metric_alarm.lambda_sending_news_error will be created
  + resource "aws_cloudwatch_metric_alarm" "lambda_sending_news_error" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Lambda Sending News Error"
      + alarm_name                            = "lambda-sending-news-errors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "news-lambda-handler"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # module.monitoring.aws_cloudwatch_metric_alarm.rds_lag will be created
  + resource "aws_cloudwatch_metric_alarm" "rds_lag" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "RDS ReplicaLag > 60s"
      + alarm_name                            = "rds-replica-lag"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "news-rds"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ReplicaLag"
      + namespace                             = "AWS/RDS"
      + period                                = 60
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 60
      + treat_missing_data                    = "missing"
    }

  # module.monitoring.aws_grafana_workspace_api_key.terraform will be created
  + resource "aws_grafana_workspace_api_key" "terraform" {
      + id              = (known after apply)
      + key             = (sensitive value)
      + key_name        = "tf-provisioner"
      + key_role        = "ADMIN"
      + seconds_to_live = 86400
      + workspace_id    = (known after apply)
    }

  # module.monitoring.grafana_dashboard.overview will be created
  + resource "grafana_dashboard" "overview" {
      + config_json  = jsonencode(
            {
              + panels = [
                  + {
                      + datasource = "CloudWatch"
                      + targets    = [
                          + {
                              + dimensions = {
                                  + DBInstanceIdentifier = "news-rds"
                                }
                              + metricName = "ReplicaLag"
                              + namespace  = "AWS/RDS"
                              + period     = 60
                              + refId      = "RDS_ReplicaLag"
                              + region     = "ap-northeast-2"
                              + stat       = "Maximum"
                            },
                        ]
                      + title      = "RDS Replica Lag (s)"
                      + type       = "timeSeries"
                    },
                  + {
                      + datasource = "CloudWatch"
                      + targets    = [
                          + {
                              + dimensions = {
                                  + FunctionName = "news-lambda-handler"
                                }
                              + metricName = "Errors"
                              + namespace  = "AWS/Lambda"
                              + period     = 60
                              + refId      = "LambdaErr_sending"
                              + region     = "ap-northeast-2"
                              + stat       = "Sum"
                            },
                        ]
                      + title      = "Lambda Errors - sending_news"
                      + type       = "stat"
                    },
                  + {
                      + datasource = "CloudWatch"
                      + targets    = [
                          + {
                              + expression = "SEARCH('{/aws/lambda/news-lambda-handler} \"메일 전송 성공\"', 'Count', 60)"
                              + refId      = "MailOK_sending"
                              + region     = "ap-northeast-2"
                            },
                        ]
                      + title      = "메일 전송 성공"
                      + type       = "stat"
                    },
                  + {
                      + datasource = "CloudWatch"
                      + targets    = [
                          + {
                              + expression = "SEARCH('{/aws/lambda/news-lambda-handler} \"메일 전송 실패\"', 'Count', 60)"
                              + refId      = "MailErr_sending"
                              + region     = "ap-northeast-2"
                            },
                        ]
                      + title      = "메일 전송 실패"
                      + type       = "stat"
                    },
                  + {
                      + datasource = "CloudWatch"
                      + targets    = [
                          + {
                              + dimensions = {
                                  + FunctionName = "news-crawler-lambda"
                                }
                              + metricName = "Errors"
                              + namespace  = "AWS/Lambda"
                              + period     = 60
                              + refId      = "LambdaErr_crawler"
                              + region     = "ap-northeast-2"
                              + stat       = "Sum"
                            },
                        ]
                      + title      = "Lambda Errors - crawler"
                      + type       = "stat"
                    },
                  + {
                      + datasource = "CloudWatch"
                      + targets    = [
                          + {
                              + expression = "SEARCH('{/aws/lambda/news-crawler-lambda} \"크롤링 성공\"', 'Count', 60)"
                              + refId      = "CrawlOK"
                              + region     = "ap-northeast-2"
                            },
                        ]
                      + title      = "크롤링 성공"
                      + type       = "stat"
                    },
                  + {
                      + datasource = "CloudWatch"
                      + targets    = [
                          + {
                              + expression = "SEARCH('{/aws/lambda/news-crawler-lambda} \"크롤링 삭제\"', 'Count', 60)"
                              + refId      = "CrawlDel"
                              + region     = "ap-northeast-2"
                            },
                        ]
                      + title      = "크롤링 삭제"
                      + type       = "stat"
                    },
                ]
              + time   = {
                  + from = "now-6h"
                  + to   = "now"
                }
              + title  = "NewsSubscribe Monitoring Dashboard"
            }
        )
      + dashboard_id = (known after apply)
      + folder       = "NewsSubscribe"
      + id           = (known after apply)
      + uid          = (known after apply)
      + url          = (known after apply)
      + version      = (known after apply)
    }

  # module.monitoring.grafana_data_source.cloudwatch will be created
  + resource "grafana_data_source" "cloudwatch" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = (known after apply)
      + name               = "CloudWatch"
      + type               = "cloudwatch"
      + uid                = (known after apply)
    }

  # module.nat.aws_eip.nat_eip will be created
  + resource "aws_eip" "nat_eip" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = (known after apply)
      + vpc                  = (known after apply)
    }

  # module.nat.aws_nat_gateway.nat will be created
  + resource "aws_nat_gateway" "nat" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "nat-gateway"
        }
      + tags_all                           = {
          + "Name" = "nat-gateway"
        }
    }

  # module.rds.aws_db_instance.this will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = "NewsSubscribe"
      + db_subnet_group_name                  = "news-rds"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "8.0"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "news-rds"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = true
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "news-rds-timezone"
      + password                              = (sensitive value)
      + password_wo                           = (write-only attribute)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = false
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Name" = "news-rds"
        }
      + tags_all                              = {
          + "Name" = "news-rds"
        }
      + timezone                              = (known after apply)
      + username                              = "root"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.rds.aws_db_parameter_group.timezone will be created
  + resource "aws_db_parameter_group" "timezone" {
      + arn          = (known after apply)
      + description  = "Managed by Terraform"
      + family       = "mysql8.0"
      + id           = (known after apply)
      + name         = "news-rds-timezone"
      + name_prefix  = (known after apply)
      + skip_destroy = false
      + tags_all     = (known after apply)

      + parameter {
          + apply_method = "immediate"
          + name         = "character_set_server"
          + value        = "utf8mb4"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "collation_server"
          + value        = "utf8mb4_unicode_ci"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "time_zone"
          + value        = "Asia/Seoul"
        }
    }

  # module.rds.aws_db_subnet_group.this will be created
  + resource "aws_db_subnet_group" "this" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "news-rds"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "news-rds"
        }
      + tags_all                = {
          + "Name" = "news-rds"
        }
      + vpc_id                  = (known after apply)
    }

  # module.route.aws_route.private_route will be created
  + resource "aws_route" "private_route" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.route.aws_route.public_route will be created
  + resource "aws_route" "public_route" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.route.aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "private-route-table"
        }
      + tags_all         = {
          + "Name" = "private-route-table"
        }
      + vpc_id           = (known after apply)
    }

  # module.route.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "public-route-table"
        }
      + tags_all         = {
          + "Name" = "public-route-table"
        }
      + vpc_id           = (known after apply)
    }

  # module.route.aws_route_table_association.private_1 will be created
  + resource "aws_route_table_association" "private_1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.route.aws_route_table_association.private_2 will be created
  + resource "aws_route_table_association" "private_2" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.route.aws_route_table_association.public_1 will be created
  + resource "aws_route_table_association" "public_1" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.route.aws_route_table_association.public_2 will be created
  + resource "aws_route_table_association" "public_2" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.security_group.aws_security_group.app_sg will be created
  + resource "aws_security_group" "app_sg" {
      + arn                    = (known after apply)
      + description            = "Common app-level SG"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow access from anywhere"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "app-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "app-sg"
        }
      + tags_all               = {
          + "Name" = "app-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security_group.aws_security_group.rds_sg will be created
  + resource "aws_security_group" "rds_sg" {
      + arn                    = (known after apply)
      + description            = "Allow DB access from app SG"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow access from anywhere"
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3306
            },
        ]
      + name                   = "rds-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "rds-sg"
        }
      + tags_all               = {
          + "Name" = "rds-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # module.sending_news.data.archive_file.lambda_zip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "lambda_zip" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/sending_news/lambda_function.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "../../modules/lambda/sending_news/lambda_function.py"
      + type                = "zip"
    }

  # module.sending_news.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/lambda/sending_news/lambda_function.zip"
      + function_name                  = "news-lambda-handler"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.11"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = (known after apply)
          + subnet_ids                  = (known after apply)
          + vpc_id                      = (known after apply)
        }
    }

  # module.sns.aws_sns_topic.this will be created
  + resource "aws_sns_topic" "this" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + display_name                = "NewsSubscribe Alarms"
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "news-subscribe-alarm-topic"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "Project" = "NewsSubscribe"
        }
      + tags_all                    = {
          + "Project" = "NewsSubscribe"
        }
      + tracing_config              = (known after apply)
    }

  # module.sql_initializer.data.archive_file.lambda_zip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "lambda_zip" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/sql_initializer/sql_init.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "../../modules/lambda/sql_initializer"
      + type                = "zip"
    }

  # module.sql_initializer.aws_lambda_function.sql_initializer will be created
  + resource "aws_lambda_function" "sql_initializer" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/lambda/sql_initializer/sql_init.zip"
      + function_name                  = "rds-sql-initializer"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.11"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = (known after apply)
          + subnet_ids                  = (known after apply)
          + vpc_id                      = (known after apply)
        }
    }

  # module.subnet.aws_subnet.private_3b will be created
  + resource "aws_subnet" "private_3b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                               = "private-subnet-3b"
          + "kubernetes.io/cluster/news-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"    = "1"
        }
      + tags_all                                       = {
          + "Name"                               = "private-subnet-3b"
          + "kubernetes.io/cluster/news-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"    = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnet.aws_subnet.private_4d will be created
  + resource "aws_subnet" "private_4d" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                               = "private-subnet-4d"
          + "kubernetes.io/cluster/news-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"    = "1"
        }
      + tags_all                                       = {
          + "Name"                               = "private-subnet-4d"
          + "kubernetes.io/cluster/news-cluster" = "shared"
          + "kubernetes.io/role/internal-elb"    = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnet.aws_subnet.public_1a will be created
  + resource "aws_subnet" "public_1a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                               = "public-subnet-1a"
          + "kubernetes.io/cluster/news-cluster" = "shared"
          + "kubernetes.io/role/elb"             = "1"
        }
      + tags_all                                       = {
          + "Name"                               = "public-subnet-1a"
          + "kubernetes.io/cluster/news-cluster" = "shared"
          + "kubernetes.io/role/elb"             = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.subnet.aws_subnet.public_2c will be created
  + resource "aws_subnet" "public_2c" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                               = "public-subnet-2c"
          + "kubernetes.io/cluster/news-cluster" = "shared"
          + "kubernetes.io/role/elb"             = "1"
        }
      + tags_all                                       = {
          + "Name"                               = "public-subnet-2c"
          + "kubernetes.io/cluster/news-cluster" = "shared"
          + "kubernetes.io/role/elb"             = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "192.168.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "team-vpc"
        }
      + tags_all                             = {
          + "Name" = "team-vpc"
        }
    }

  # module.monitoring.module.grafana.data.aws_subnet.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = (known after apply)
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + available_ip_address_count                     = (known after apply)
      + cidr_block                                     = (known after apply)
      + customer_owned_ipv4_pool                       = (known after apply)
      + default_for_az                                 = (known after apply)
      + enable_dns64                                   = (known after apply)
      + enable_lni_at_device_index                     = (known after apply)
      + enable_resource_name_dns_a_record_on_launch    = (known after apply)
      + enable_resource_name_dns_aaaa_record_on_launch = (known after apply)
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = (known after apply)
      + map_customer_owned_ip_on_launch                = (known after apply)
      + map_public_ip_on_launch                        = (known after apply)
      + outpost_arn                                    = (known after apply)
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + state                                          = (known after apply)
      + tags                                           = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # module.monitoring.module.grafana.aws_grafana_license_association.this[0] will be created
  + resource "aws_grafana_license_association" "this" {
      + free_trial_expiration = (known after apply)
      + id                    = (known after apply)
      + license_expiration    = (known after apply)
      + license_type          = "ENTERPRISE"
      + workspace_id          = (known after apply)
    }

  # module.monitoring.module.grafana.aws_grafana_workspace.this[0] will be created
  + resource "aws_grafana_workspace" "this" {
      + account_access_type       = "CURRENT_ACCOUNT"
      + arn                       = (known after apply)
      + authentication_providers  = [
          + "AWS_SSO",
        ]
      + configuration             = (known after apply)
      + data_sources              = [
          + "CLOUDWATCH",
        ]
      + endpoint                  = (known after apply)
      + grafana_version           = (known after apply)
      + id                        = (known after apply)
      + name                      = "news-subscribe-grafana"
      + notification_destinations = []
      + organizational_units      = []
      + permission_type           = "SERVICE_MANAGED"
      + role_arn                  = (known after apply)
      + saml_configuration_status = (known after apply)
      + stack_set_name            = "news-subscribe-grafana"
      + tags_all                  = (known after apply)

      + vpc_configuration {
          + security_group_ids = (known after apply)
          + subnet_ids         = (known after apply)
        }
    }

  # module.monitoring.module.grafana.aws_iam_policy.this[0] will be created
  + resource "aws_iam_policy" "this" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "news-subscribe-grafana-"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "cloudwatch:ListMetrics",
                          + "cloudwatch:GetMetricStatistics",
                          + "cloudwatch:GetMetricData",
                          + "cloudwatch:DescribeAlarmsForMetric",
                          + "cloudwatch:DescribeAlarms",
                          + "cloudwatch:DescribeAlarmHistory",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowReadingMetricsFromCloudWatch"
                    },
                  + {
                      + Action   = [
                          + "logs:StopQuery",
                          + "logs:StartQuery",
                          + "logs:GetQueryResults",
                          + "logs:GetLogGroupFields",
                          + "logs:GetLogEvents",
                          + "logs:DescribeLogGroups",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowReadingLogsFromCloudWatch"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeTags",
                          + "ec2:DescribeRegions",
                          + "ec2:DescribeInstances",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowReadingTagsInstancesRegionsFromEC2"
                    },
                  + {
                      + Action   = "tag:GetResources"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowReadingResourcesForTags"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.monitoring.module.grafana.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "grafana.amazonaws.com"
                        }
                      + Sid       = "GrafanaAssume"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "news-subscribe-grafana-"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.monitoring.module.grafana.aws_iam_role_policy_attachment.this["this"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.monitoring.module.grafana.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "news-subscribe-grafana-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = (known after apply)
    }

Plan: 63 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "db_password" but a value
was found in file "terraform.auto.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

<!-- Sticky Pull Request Comment -->